wosayttn/Gerrit_NuMicro/M2003xI_M2003xJ_Series/Library/StdDriver/src/i2c.c
    case 2:
        i2c->ADDR2  = u32AddrRegValue;
        break;

    case 3:
        i2c->ADDR3  = u32AddrRegValue;
        break;

    case 0:
    default:
        i2c->ADDR0  = u32AddrRegValue;
        break;
    }
}

/**
 * @brief      Configure the mask bits of Slave Address
 *
 * @param[in]  i2c              Specify I2C port
 * @param[in]  u8SlaveNo        Set the number of I2C address mask register (0~3)
 * @param[in]  u16SlaveAddrMask Slave address mask
 *
 * @return     None
 *
 * @details    This function is used to set slave addresses.
 *
 */
void I2C_SetSlaveAddrMask(I2C_T *i2c, uint8_t u8SlaveNo, uint16_t u16SlaveAddrMask)
{
    uint32_t u32AddrMskRegValue = ((((uint32_t)u16SlaveAddrMask) & 0x3FFUL) << 1UL);

    switch (u8SlaveNo)
    {
    case 1:
        i2c->ADDRMSK1  = u32AddrMskRegValue;
        break;

    case 2:
        i2c->ADDRMSK2  = u32AddrMskRegValue;
        break;

    case 3:
        i2c->ADDRMSK3  = u32AddrMskRegValue;
        break;

    case 0:
    default:
        i2c->ADDRMSK0  = u32AddrMskRegValue;
        break;
    }
}

/**
 * @brief      Enable Time-out Counter Function and support Long Time-out
 *
 * @param[in]  i2c              Specify I2C port
 * @param[in]  u8LongTimeout    Configure DIV4 to enable Long Time-out (0/1)
 *
 * @return     None
 *
 * @details    This function enable Time-out Counter function and configure DIV4 to support Long
 *             Time-out.
 *
 */
void I2C_EnableTimeout(I2C_T *i2c, uint8_t u8LongTimeout)
{
    if (u8LongTimeout)
    {
        i2c->TOCTL |= I2C_TOCTL_TOCDIV4_Msk;
    }
    else
    {
        i2c->TOCTL &= ~I2C_TOCTL_TOCDIV4_Msk;
    }

    i2c->TOCTL |= I2C_TOCTL_TOCEN_Msk;
}

/**
 * @brief      Disable Time-out Counter Function
 *
 * @param[in]  i2c          Specify I2C port
 *
 * @return     None
 *
 * @details    To disable Time-out Counter function in I2C_TOCTL register.
 *
 */
void I2C_DisableTimeout(I2C_T *i2c)
{
    i2c->TOCTL &= ~I2C_TOCTL_TOCEN_Msk;
}

/**
 * @brief      Enable I2C Wake-up Function
 *
 * @param[in]  i2c          Specify I2C port
 *
 * @return     None
 *
 * @details    To enable Wake-up function of I2C Wake-up control register.
 *
 */
void I2C_EnableWakeup(I2C_T *i2c)
{
    i2c->WKCTL |= I2C_WKCTL_WKEN_Msk;
}

/**
 * @brief      Disable I2C Wake-up Function
 *
 * @param[in]  i2c          Specify I2C port
 *
 * @return     None
 *
 * @details    To disable Wake-up function of I2C Wake-up control register.
 *
 */
void I2C_DisableWakeup(I2C_T *i2c)
{
    i2c->WKCTL &= ~I2C_WKCTL_WKEN_Msk;
}

/**
 * @brief      Enable I2C Two-level Buffer Function
 *
 * @param[in]  i2c          Specify I2C port
 * @param[in]  u32BitCount  The bit count of date phase.
 *                          - \ref I2C_DATA_PHASE_BIT_6
 *                          - \ref I2C_DATA_PHASE_BIT_7
 *                          - \ref I2C_DATA_PHASE_BIT_8
 *
 * @return     None
 *
 * @details    To enable I2C slave mode two-level buffer function.
 *
 */
void I2C_EnableTwoBufferMode(I2C_T *i2c, uint32_t u32BitCount)
{
    /* Enable slave read and data phase interrupt and set data phase bit count */
    i2c->CTL0 = (i2c->CTL0 & ~0xC33CUL) | (I2C_CTL0_SRCINTEN_Msk | I2C_CTL0_DPCINTEN_Msk | u32BitCount);

    /* Enable Two-level buffer mode */
    i2c->CTL1 |= I2C_CTL1_TWOBUFEN_Msk;
}

/**
 * @brief      Disable I2C Two-level Buffer Function
 *
 * @param[in]  i2c          Specify I2C port
 *
 * @return     None
 *
 * @details    To disable I2C slave mode two-level buffer function.
 *
 */
void I2C_DisableTwoBufferMode(I2C_T *i2c)
{
    /* Disable slave read and data phase interrupt */
    i2c->CTL0 = (i2c->CTL0 & ~0xC03CUL) & ~(I2C_CTL0_SRCINTEN_Msk | I2C_CTL0_DPCINTEN_Msk | I2C_CTL0_DPBITSEL_Msk);

    /* Disable Two-level buffer mode */
    i2c->CTL1 &= ~I2C_CTL1_TWOBUFEN_Msk;
}

/**
  * @brief      Write multi bytes to Slave
  *
  * @param[in]  i2c             Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  data[]          Pointer to array to write data to Slave
  * @param[in]  u32wLen         How many bytes need to write to Slave
  *
  * @return     A length of how many bytes have been transmitted.
  *
  * @details    The function is used for I2C Master write multi bytes data to Slave.
  *             Support one byte or multi bytes.
  *
  */

uint32_t I2C_WriteMultiBytes(I2C_T *i2c, uint8_t u8SlaveAddr, const uint8_t data[], uint32_t u32wLen)
{
    uint8_t u8Xfering = 1u;
    uint8_t u8Err = 0u;
    uint32_t u32Ctrl = I2C_CTL_SI;
    uint32_t u32txLen = 0u;
    uint32_t u32TimeOutCount;

    g_I2C_i32ErrCode = 0;

    I2C_START(i2c);                                                      /* Send START */
    while(u8Xfering && (u8Err == 0u))
    {
        u32TimeOutCount = I2C_TIMEOUT;
        I2C_WAIT_READY(i2c)
        {
            if (--u32TimeOutCount == 0)
            {
                g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
                u8Err = 1u;
                break;
            }
        }

        switch(I2C_GET_STATUS(i2c))
        {
        case 0x08u:
            I2C_SET_DATA(i2c, (uint8_t)(u8SlaveAddr << 1u));             /* Write SLA+W to Register I2CDAT */
            u32Ctrl = I2C_CTL_SI;                                        /* Clear SI */
            break;
        case 0x18u:                                                      /* Slave Address ACK */
        case 0x28u:
            if(u32txLen < u32wLen)
            {
                I2C_SET_DATA(i2c, data[u32txLen]);                       /* Write Data to I2CDAT */
                u32txLen++;
            }
            else
            {
                u32Ctrl = I2C_CTL_STO_SI;                                /* Clear SI and send STOP */
                u8Xfering = 0u;
            }
            break;
        case 0x20u:                                                      /* Slave Address NACK */
        case 0x30u:                                                      /* Master transmit data NACK */
            u32Ctrl = I2C_CTL_STO_SI;                                    /* Clear SI and send STOP */
            u8Err = 1u;
            break;
        case 0x38u:                                                      /* Arbitration Lost */
        default:                                                         /* Unknown status */
            I2C_SET_CONTROL_REG(i2c, I2C_CTL_STO_SI);                    /* Clear SI and send STOP */
            u32Ctrl = I2C_CTL_SI;
            u8Err = 1u;
            break;
        }
        I2C_SET_CONTROL_REG(i2c, u32Ctrl);                               /* Write control bit to I2C_CTL register */
    }

    u32TimeOutCount = I2C_TIMEOUT;
    while ((i2c)->CTL0 & I2C_CTL0_STO_Msk)
    {
        u32TimeOutCount--;
        if (u32TimeOutCount == 0UL)
        {
            g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
            break;
        }
    }

