wosayttn/Gerrit_NuMicro/M2003xI_M2003xJ_Series/Library/StdDriver/src/i2c.c
    return u32txLen;                                                     /* Return bytes length that have been transmitted */
}

/**
  * @brief      Read multi bytes from Slave
  *
  * @param[in]  i2c             Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[out] rdata[]         A data array to store data from Slave
  * @param[in]  u32rLen         How many bytes need to read from Slave
  *
  * @return     A length of how many bytes have been received
  *
  * @details    The function is used for I2C Master to read multi data bytes from Slave.
  *             Support one byte or multi bytes.
  *
  *
  */
uint32_t I2C_ReadMultiBytes(I2C_T *i2c, uint8_t u8SlaveAddr, uint8_t rdata[], uint32_t u32rLen)
{
    uint8_t u8Xfering = 1u;
    uint8_t u8Err = 0u;
    uint32_t u32Ctrl = I2C_CTL_SI;
    uint32_t u32rxLen = 0u;
    uint32_t u32TimeOutCount;

    g_I2C_i32ErrCode = 0;

    I2C_START(i2c);                                                      /* Send START */
    while(u8Xfering && (u8Err == 0u))
    {
        u32TimeOutCount = I2C_TIMEOUT;
        I2C_WAIT_READY(i2c)
        {
            if (--u32TimeOutCount == 0)
            {
                g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
                u8Err = 1u;
                break;
            }
        }

        switch(I2C_GET_STATUS(i2c))
        {
        case 0x08u:
            I2C_SET_DATA(i2c, (uint8_t)((u8SlaveAddr << 1u) | 0x01u));   /* Write SLA+R to Register I2CDAT */
            u32Ctrl = I2C_CTL_SI;                                        /* Clear SI */
            break;
        case 0x40u:                                                      /* Slave Address ACK */
            if (u32rLen == 1UL)
            {
                u32Ctrl = I2C_CTL_SI;                                    /* Clear SI */
            }
            else
            {
                u32Ctrl = I2C_CTL_SI_AA;                                 /* Clear SI and set ACK */
            }
            break;
        case 0x48u:                                                      /* Slave Address NACK */
            u32Ctrl = I2C_CTL_STO_SI;                                    /* Clear SI and send STOP */
            u8Err = 1u;
            break;
        case 0x50u:
            rdata[u32rxLen] = (uint8_t) I2C_GET_DATA(i2c);               /* Receive Data */
            u32rxLen++;

            if(u32rxLen < (u32rLen - 1u))
            {
                u32Ctrl = I2C_CTL_SI_AA;                                 /* Clear SI and set ACK */
            }
            else
            {
                u32Ctrl = I2C_CTL_SI;                                    /* Clear SI */
            }
            break;
        case 0x58u:
            rdata[u32rxLen] = (uint8_t) I2C_GET_DATA(i2c);               /* Receive Data */
            u32rxLen++;
            u32Ctrl = I2C_CTL_STO_SI;                                    /* Clear SI and send STOP */
            u8Xfering = 0u;
            break;
        case 0x38u:                                                      /* Arbitration Lost */
        default:                                                         /* Unknown status */
            I2C_SET_CONTROL_REG(i2c, I2C_CTL_STO_SI);                    /* Clear SI and send STOP */
            u32Ctrl = I2C_CTL_SI;
            u8Err = 1u;
            break;
        }
        I2C_SET_CONTROL_REG(i2c, u32Ctrl);                               /* Write control bit to I2C_CTL register */
    }

    u32TimeOutCount = I2C_TIMEOUT;
    while ((i2c)->CTL0 & I2C_CTL0_STO_Msk)
    {
        u32TimeOutCount--;
        if (u32TimeOutCount == 0UL)
        {
            g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
            break;
        }
    }

    return u32rxLen;                                                     /* Return bytes length that have been received */
}

/**
  * @brief      Specify a byte register address and read multi bytes from Slave
  *
  * @param[in]  i2c             Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  u8DataAddr      Specify a address (1 byte) of data read from
  * @param[out] rdata[]         A data array to store data from Slave
  * @param[in]  u32rLen         How many bytes need to read from Slave
  *
  * @return     A length of how many bytes have been received
  *
  * @details    The function is used for I2C Master specify a byte address that multi data bytes read from Slave.
  *             Support one byte or multi bytes.
  *
  *
  */
uint32_t I2C_ReadMultiBytesOneReg(I2C_T *i2c, uint8_t u8SlaveAddr, uint8_t u8DataAddr, uint8_t rdata[], uint32_t u32rLen)
{
    uint8_t u8Xfering = 1u;
    uint8_t u8Err = 0u;
    uint32_t u32Ctrl = I2C_CTL_SI;
    uint32_t u32rxLen = 0u;
    uint32_t u32TimeOutCount;

    g_I2C_i32ErrCode = 0;

    I2C_START(i2c);                                                      /* Send START */
    while(u8Xfering && (u8Err == 0u))
    {
        u32TimeOutCount = I2C_TIMEOUT;
        I2C_WAIT_READY(i2c)
        {
            if (--u32TimeOutCount == 0)
            {
                g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
                u8Err = 1u;
                break;
            }
        }

        switch(I2C_GET_STATUS(i2c))
        {
        case 0x08u:
            I2C_SET_DATA(i2c, (uint8_t)(u8SlaveAddr << 1u));             /* Write SLA+W to Register I2CDAT */
            u32Ctrl = I2C_CTL_SI;                                        /* Clear SI */
            break;
        case 0x18u:                                                      /* Slave Address ACK */
            I2C_SET_DATA(i2c, u8DataAddr);                               /* Write Lo byte address of register */
            break;
        case 0x20u:                                                      /* Slave Address NACK */
        case 0x30u:                                                      /* Master transmit data NACK */
            u32Ctrl = I2C_CTL_STO_SI;                                    /* Clear SI and send STOP */
            u8Err = 1u;
            break;
        case 0x28u:
            u32Ctrl = I2C_CTL_STA_SI;                                    /* Send repeat START */
            break;
        case 0x10u:
            I2C_SET_DATA(i2c, (uint8_t)((u8SlaveAddr << 1u) | 0x01u));   /* Write SLA+R to Register I2CDAT */
            u32Ctrl = I2C_CTL_SI;                                        /* Clear SI */
            break;
        case 0x40u:                                                      /* Slave Address ACK */
            if (u32rLen == 1UL)
            {
                u32Ctrl = I2C_CTL_SI;                                    /* Clear SI */
            }
            else
            {
                u32Ctrl = I2C_CTL_SI_AA;                                 /* Clear SI and set ACK */
            }
            break;
        case 0x48u:                                                      /* Slave Address NACK */
            u32Ctrl = I2C_CTL_STO_SI;                                    /* Clear SI and send STOP */
            u8Err = 1u;
            break;
        case 0x50u:
            rdata[u32rxLen] = (uint8_t) I2C_GET_DATA(i2c);               /* Receive Data */
            u32rxLen++;
            if(u32rxLen < (u32rLen - 1u))
            {
                u32Ctrl = I2C_CTL_SI_AA;                                 /* Clear SI and set ACK */
            }
            else
            {
                u32Ctrl = I2C_CTL_SI;                                    /* Clear SI */
            }
            break;
        case 0x58u:
            rdata[u32rxLen] = (uint8_t) I2C_GET_DATA(i2c);               /* Receive Data */
            u32rxLen++;
            u32Ctrl = I2C_CTL_STO_SI;                                    /* Clear SI and send STOP */
            u8Xfering = 0u;
            break;
        case 0x38u:                                                      /* Arbitration Lost */
        default:                                                         /* Unknown status */
            I2C_SET_CONTROL_REG(i2c, I2C_CTL_STO_SI);                    /* Clear SI and send STOP */
            u32Ctrl = I2C_CTL_SI;
            u8Err = 1u;
            break;
        }
        I2C_SET_CONTROL_REG(i2c, u32Ctrl);                               /* Write control bit to I2C_CTL register */
    }

    u32TimeOutCount = I2C_TIMEOUT;
    while ((i2c)->CTL0 & I2C_CTL0_STO_Msk)
    {
        u32TimeOutCount--;
        if (u32TimeOutCount == 0UL)
        {
            g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
            break;
        }
    }

    return u32rxLen;                                                     /* Return bytes length that have been received */
}

/**
  * @brief      Specify two bytes register address and read multi bytes from Slave
  *
  * @param[in]  i2c             Point to I2C peripheral
  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
  * @param[in]  u16DataAddr     Specify a address (2 bytes) of data read from
  * @param[out] rdata[]         A data array to store data from Slave
  * @param[in]  u32rLen         How many bytes need to read from Slave
  *
  * @return     A length of how many bytes have been received
  *
  * @details    The function is used for I2C Master specify two bytes address that multi data bytes read from Slave.
  *             Support one byte or multi bytes.
  *
  *
  */
uint32_t I2C_ReadMultiBytesTwoRegs(I2C_T *i2c, uint8_t u8SlaveAddr, uint16_t u16DataAddr, uint8_t rdata[], uint32_t u32rLen)
{
    uint8_t u8Xfering = 1u;
    uint8_t u8Err = 0u;
    uint8_t u8Addr = 1u;
    uint32_t u32Ctrl = I2C_CTL_SI;
    uint32_t u32rxLen = 0u;
    uint32_t u32TimeOutCount;

    g_I2C_i32ErrCode = 0;

    I2C_START(i2c);                                                      /* Send START */
    while(u8Xfering && (u8Err == 0u))
    {
        u32TimeOutCount = I2C_TIMEOUT;
        I2C_WAIT_READY(i2c)
        {
            if (--u32TimeOutCount == 0)
            {
                g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
                u8Err = 1u;
                break;
            }
        }

        switch(I2C_GET_STATUS(i2c))
        {
        case 0x08u:
            I2C_SET_DATA(i2c, (uint8_t)(u8SlaveAddr << 1u));             /* Write SLA+W to Register I2CDAT */
            u32Ctrl = I2C_CTL_SI;                                        /* Clear SI */
            break;
        case 0x18u:                                                      /* Slave Address ACK */
            I2C_SET_DATA(i2c, (uint8_t)((u16DataAddr & 0xFF00u) >> 8u)); /* Write Hi byte address of register */
            break;
        case 0x20u:                                                      /* Slave Address NACK */
        case 0x30u:                                                      /* Master transmit data NACK */
            u32Ctrl = I2C_CTL_STO_SI;                                    /* Clear SI and send STOP */
            u8Err = 1u;
            break;
        case 0x28u:
            if(u8Addr)
            {
                I2C_SET_DATA(i2c, (uint8_t)(u16DataAddr & 0xFFu));       /* Write Lo byte address of register */
                u8Addr = 0u;
            }
            else
            {
                u32Ctrl = I2C_CTL_STA_SI;                                /* Clear SI and send repeat START */
            }
            break;
        case 0x10u:
            I2C_SET_DATA(i2c, (uint8_t)((u8SlaveAddr << 1u) | 0x01u));   /* Write SLA+R to Register I2CDAT */
            u32Ctrl = I2C_CTL_SI;                                        /* Clear SI */
            break;
        case 0x40u:                                                      /* Slave Address ACK */
            if (u32rLen == 1UL)
            {
                u32Ctrl = I2C_CTL_SI;                                    /* Clear SI */
            }
            else
            {
                u32Ctrl = I2C_CTL_SI_AA;                                 /* Clear SI and set ACK */
            }
            break;
        case 0x48u:                                                      /* Slave Address NACK */
            u32Ctrl = I2C_CTL_STO_SI;                                    /* Clear SI and send STOP */
            u8Err = 1u;
            break;
        case 0x50u:
            rdata[u32rxLen] = (uint8_t) I2C_GET_DATA(i2c);               /* Receive Data */
            u32rxLen++;
            if(u32rxLen < (u32rLen - 1u))
            {
                u32Ctrl = I2C_CTL_SI_AA;                                 /* Clear SI and set ACK */
            }
            else
            {
                u32Ctrl = I2C_CTL_SI;                                    /* Clear SI */
            }
            break;
        case 0x58u:
            rdata[u32rxLen] = (uint8_t) I2C_GET_DATA(i2c);               /* Receive Data */
            u32rxLen++;
            u32Ctrl = I2C_CTL_STO_SI;                                    /* Clear SI and send STOP */
            u8Xfering = 0u;
            break;
        case 0x38u:                                                      /* Arbitration Lost */
        default:                                                         /* Unknown status */
            I2C_SET_CONTROL_REG(i2c, I2C_CTL_STO_SI);                    /* Clear SI and send STOP */
            u32Ctrl = I2C_CTL_SI;
            u8Err = 1u;
            break;
        }
        I2C_SET_CONTROL_REG(i2c, u32Ctrl);                               /* Write control bit to I2C_CTL register */
    }

    u32TimeOutCount = I2C_TIMEOUT;
    while ((i2c)->CTL0 & I2C_CTL0_STO_Msk)
    {
        u32TimeOutCount--;
        if (u32TimeOutCount == 0UL)
        {
            g_I2C_i32ErrCode = I2C_ERR_TIMEOUT;
            break;
        }
    }

    return u32rxLen;                                                     /* Return bytes length that have been received */
}


/*@}*/ /* end of group I2C_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group I2C_Driver */

/*@}*/ /* end of group Standard_Driver */

/*** (C) COPYRIGHT 2025 Nuvoton Technology Corp. ***/
